<template>
  <main class="page">
    <div class="screen">
      <Background/>
      <div class="screen__container">
        <Logo/>
        <div class="screen__body">
          <Doves/>
          <div class="screen__content">
            <p class="screen__text">
              К началу русско-турецкой войны 1877—1878 годов в русских инженерных войсках появились новые специальности: воздухоплавание и голубиная связь.
            </p>
            <p class="screen__text">
              В 1887 году в русской армии была учреждена отдельная военно-голубиная почта для поддержания в военное время сообщения с осаждёнными крепостями.
              Почтово-голубиные станции устраивались в крепостях и в других пунктах по указаниям Главного инженерного управления.
            </p>
            <p class="screen__text">Для поддержания соответствующей породы голубей при голубиной станции в Брест-Литовске было учреждено племенное депо.</p>
            <p class="screen__text">
              Для ухода за голубями при каждой станции состояли голубеводы-надзиратели. У каждого почтового голубя имелся штемпель военно-голубиной почты -
              такие птицы считались казённым имуществом.
            </p>
            <p class="screen__text">
              К концу XIX века почти во всех странах Европы пользовались голубями для военных целей. Особые военные голубятни содержали в крепостях и городах.
              В большинстве стран в случае войны частные общества были обязаны передавать своих птиц в военное ведомство. Так, во Франции существовало 19
              станций голубиной почты, в Португалии – 14, в Испании – 18, в Италии – 14, в Германии – 17, Австро-Венгрии – 7, в России – 5.
            </p>
            <p class="screen__text">
              Голубиная связь использовалась войсками в конце XIX — начале XX веков, включая Первую мировую войну, Гражданскую войну 1918—1920 годов и Вторую
              мировую войну.
            </p>
            <p class="screen__text">
              Своего расцвета голубиная почта достигла в годы Первой мировой войны, официально оформившись в военное направление — военно-голубиную связь.
            </p>
            <p class="screen__text">Организация голубиной связи во всех армиях была приблизительно одинаковой.</p>
            <p class="screen__text">
              На военных станциях голубям клеймили крыло и крепили к ноге колечко. Оно представляло собой медную коробочку, в середину которой вставляли
              цифры: римские - обозначающие месяц, и арабские — означающие число рождения и год. По краям коробки были буквы станций назначения.
            </p>
          </div>
          <Navigation :page-next="pageNext" :page-prev="pagePrev"/>
        </div>
      </div>
    </div>
  </main>
</template>

<script>
import {mapActions} from 'vuex'
import Navigation from "@/components/Navigation";
import Doves from "@/components/Doves";
import Logo from "@/components/Logo";
import Background from "@/components/Background";

export default {
  name: "Page-4",
  data() {
    return {
      pagePrev: 'page-3',
      pageNext: 'page-5',
    }
  },
  components: {
    Doves,
    Logo,
    Background,
    Navigation
  },
  mounted() {
    this.animate()
  },
  methods: {
    ...mapActions([
      'animate'
    ]),
  }
}
</script>